curiouschip/Arduino-hardware/avr/boards.txt
piptouch.name=PipTouch
leonardo.vid.0=0x2341
leonardo.pid.0=0x0036
leonardo.vid.1=0x2341
leonardo.pid.1=0x8036

piptouch.upload.tool=arduino:avrdude
piptouch.upload.protocol=avr109
piptouch.upload.maximum_size=28672
piptouch.upload.maximum_data_size=2560
piptouch.upload.speed=57600
piptouch.upload.disable_flushing=true
piptouch.upload.use_1200bps_touch=true
piptouch.upload.wait_for_upload_port=true

piptouch.bootloader.tool=arduino:avrdude
piptouch.bootloader.low_fuses=0xff
piptouch.bootloader.high_fuses=0xd8
piptouch.bootloader.extended_fuses=0xcb
piptouch.bootloader.file=caterina/Caterina-PipTouch.hex
piptouch.bootloader.unlock_bits=0xFF
piptouch.bootloader.lock_bits=0xEF

piptouch.build.mcu=atmega32u4
piptouch.build.f_cpu=16000000L
piptouch.build.vid=0x2341
piptouch.build.pid=0x8036
piptouch.build.usb_manufacturer="Curious Chip"
piptouch.build.usb_product="PipTouch"
piptouch.build.board=AVR_LEONARDO
piptouch.build.core=arduino:arduino
piptouch.build.variant=piptouch
piptouch.build.extra_flags={build.usb_flags}
